//常用正则
export const regExp = {
  //整数
  intNum: /^\d+$/,
  // 有效数字
  validNum: /^-?(\d|([1-9]\d+))(\.\d+)?$/,
  // 手机
  mobile: /^1(3|4|7|5|8|9)([0-9]{9})$/,
  // 邮箱
  email: /^\w+((-\w+)|(\.\w+))*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/,
  // 身份证
  idCard: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
  // url地址，http或者https
  url: /^((https|http|ftp|rtsp|mms)?:\/\/)+[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/,
  //注册密码
  password: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,11}$/,
  // qq
  qq: /^[1-9][0-9]{4,}$/,
  //邮编
  postcode: /^[0-9]{6}$/,
  //座机
  telphone: /\d{3}-\d{8}|\d{4}-\d{7}/,
  //金钱限制
  charge: /^(\d|([1-9]\d+))(\.\d{1,2})?$/,
}
